of60/tutorials/rheoInterFoam/ImpactingDrop/Oldroyd-BLog/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6.0                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
    volVectorFieldValue U (0 0 0)
);

regions
(

    cylinderToCell
    {
      
        p1       (0 0.04 -.6); 
        p2       (0 0.04 .6);
        radius   0.01;
        
        fieldValues
        (
            volScalarFieldValue alpha.water 1
            volVectorFieldValue U (0 -1 0)
        ); 
    }

);

// ************************************************************************* //
